Revit 2026 API

# MultiServerService Methods

---

The MultiServerService type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddServer | Registers a server with its service. (Inherited from ExternalService) |
|  | Dispose | (Inherited from ExternalService) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetActiveServerIds | Returns Ids of the currently active application-level servers registered for the service. |
|  | GetActiveServerIds(Document) | Returns Ids of the servers currently applicable to the given document for the service. |
|  | GetDefaultServerId | Returns the Id of the default server if one was assigned to the service. (Inherited from ExternalService) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetOptions | A copy of the options the service was registered with. (Inherited from ExternalService) |
|  | GetPublicAccessKey | Access key to use to execute a service. (Inherited from ExternalService) |
|  | GetRegisteredServerIds | Returns Ids of all servers registered for the service. (Inherited from ExternalService) |
|  | GetServer | Returns the instance that provides implementation for a registered server. (Inherited from ExternalService) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsRegisteredServerId | Checks if the Id represents a valid server that has been registered for the service. (Inherited from ExternalService) |
|  | RemoveServer | Removes/unregisters a server from the service. (Inherited from ExternalService) |
|  | SetActiveServers(IListGuid) |  |
|  | SetActiveServers(IListGuid, Document) |  |
|  | SetServerState | This method will simply switch the active state of a server without affecting in any way the other servers. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

MultiServerService Class

Autodesk.Revit.DB.ExternalService Namespace